Mr-stm32/GOOD32/Program/HAL/hal_spi.h
/****************************************Copyright (C)**************************************************
**                                  泉州迈韦通信技术有限公司
**                                         研发部 
**                                  http://www.maiwei.com.cn   
**------------------------------------------------------------------------------------------------------
** 文件名称 : hal_spi.h 
** 内容描述 : stm32f103vet6平台下spi1和spi2初始化。
**		  					
**------------------------------------------------------------------------------------------------------
** 创 建 者 : Jason
** 版    本 : V1.0
** 创建日期 : 2020-12-10 
**------------------------------------------------------------------------------------------------------
** 修 改 者 : None	
** 版    本 : None	
** 修改日期 : None	
** 内容描述 : None	
********************************************************************************************************/
#ifndef __HAL_SPI_H_
#define __HAL_SPI_H_
/*******************************************头文件区****************************************************/
#include "stm32f10x.h"

/*******************************************配置区******************************************************/
#define DEF_STM32F10X_SPI_EN        1u

#if (DEF_STM32F10X_SPI_EN > 0)
#define SPI1_EN                     1u
#define SPI2_EN                     1u
#endif // DEF_STM32F10X_SPI_EN

#if (SPI1_EN > 0)
#define SPI1_CS_PORT         	    GPIOA
#define SPI1_CS_PIN         	    GPIO_Pin_4
#define	SPI1_CS_DISSELECT           GPIO_SetBits(SPI1_CS_PORT, SPI1_CS_PIN)
#define	SPI1_CS_SELECT              GPIO_ResetBits(SPI1_CS_PORT, SPI1_CS_PIN)    
#endif // SPI1_EN

#if (SPI2_EN > 0)
#define SPI2_CS_PORT         	    GPIOB
#define SPI2_CS_PIN         	    GPIO_Pin_12
#define	SPI2_CS_DISSELECT           GPIO_SetBits(SPI1_CS_PORT, SPI1_CS_PIN)
#define	SPI2_CS_SELECT              GPIO_ResetBits(SPI1_CS_PORT, SPI1_CS_PIN)    
#endif // SPI1_EN

/*******************************************自定义类型区************************************************/

/*******************************************接口区*******************************************************/
/*********************************************************************************************************
** 函数名称 ：fSPI1_Init
** 函数功能 ：SPI1初始化
** 入口参数 ：None
** 出口参数 ：None
** 作者日期 ：Jason 2020-12-10
**--------------------------------------------------------------------------------------------------------
** 修改作者 ：None
** 修改日期 ：None
** 修改内容 ：None
***********************************************************************************************************/
extern void fSPI1_Init(void);
/*********************************************************************************************************
** 函数名称 ：SPI1_FlashSendByte
** 函数功能 ：发送数据
** 入口参数 ：byte: 发送的数据
** 出口参数 ：None
** 作者日期 ：Jason 2020-12-10
**--------------------------------------------------------------------------------------------------------
** 修改作者 ：None
** 修改日期 ：None
** 修改内容 ：None
***********************************************************************************************************/
extern uint8_t SPI1_FlashSendByte(uint8_t byte);
/*********************************************************************************************************
** 函数名称 ：SPI1_FlashReadByte
** 函数功能 ：读取数据
** 入口参数 ：None
** 出口参数 ：读取到的数据
** 作者日期 ：Jason 2020-12-10
**--------------------------------------------------------------------------------------------------------
** 修改作者 ：None
** 修改日期 ：None
** 修改内容 ：None
***********************************************************************************************************/
extern uint8_t SPI1_FlashReadByte(void);	
/*********************************************************************************************************
** 函数名称 ：fSPI2_Init
** 函数功能 ：SPI2初始化
** 入口参数 ：None
** 出口参数 ：None
** 作者日期 ：Jason 2020-12-10
**--------------------------------------------------------------------------------------------------------
** 修改作者 ：None
** 修改日期 ：None
** 修改内容 ：None
***********************************************************************************************************/
extern void fSPI2_Init(void);
/*********************************************************************************************************
** 函数名称 ：SPI2_FlashSendByte
** 函数功能 ：发送数据
** 入口参数 ：byte: 发送的数据
** 出口参数 ：None
** 作者日期 ：Jason 2020-12-10
**--------------------------------------------------------------------------------------------------------
** 修改作者 ：None
** 修改日期 ：None
** 修改内容 ：None
***********************************************************************************************************/
extern uint8_t SPI2_FlashSendByte(uint8_t byte);
/*********************************************************************************************************
** 函数名称 ：SPI2_FlashReadByte
** 函数功能 ：读取数据
** 入口参数 ：None
** 出口参数 ：读取到的数据
** 作者日期 ：Jason 2020-12-10
**--------------------------------------------------------------------------------------------------------
** 修改作者 ：None
** 修改日期 ：None
** 修改内容 ：None
***********************************************************************************************************/
extern uint8_t SPI2_FlashReadByte(void);
#endif
/****************************************END OF FILE****************************************************/
